function openLink(url) {
    window.open(url, '_blank');
}

function openLinkAndScroll(url, sectionId) {
    location.href = `${url}#${sectionId}`;
}

const articles = [
    {
        title: 'FISU 世界学生選手権 団体5位',
        date: '8/30 <span>2024</span>',
        category: '代表戦',
        image: '../img/main/result/r1.jpg',
        content: 
`<p>2度目の世界学生に挑戦してきました。</p>
<p>開催地は世界一危険な都市とも言われる南アフリカ・ヨハネスブルグでしたが、実際に行ってみるとそんな気配をほとんど感じさせないくらい素晴らしい環境が用意されていて何不自由なく10日間を過ごすことができました。</p>
<p>結果は個人戦プレート優勝(17位)、団体戦5位と目標にしていたメダル獲得には届くことができませんでした。</p>
<p>最後の世界学生だったので悔しい思いは強いですが、2年前初めてエジプトの世界学生に出場した時とは違い、間違いなく世界と戦える力はついてきたと感じました。この2年間、プロツアーを回り日本代表の試合にも出場してきた経験値というのは大きな成長に繋がっていて、まだまだ世界との差を縮められると思えた大会になりました。</p>
<p>そして今大会一緒に行ってくれた4人には本当に感謝しています。団体戦に出場する国の中で唯一コーチがいなかったのは日本だけでしたが、そんな状況でも自分がベストを尽くせたのはこのチームのメンバーがいたからです。チームマネージャーを担当してくれたあゆみ、最年少でも女子の一番手として戦ってくれたくるみちゃん、団体ではめちゃくちゃ頼りになった優太、そして何より連れてきてくれた徳ちゃんには感謝しています。</p>
<p>そもそもこの大会は彼が支援金の内定を勝ち取ってくれなかったら自分は行くことがなかった遠征でした。彼はこの大会を最後にスカッシュの大会から身を引いてしまいますが、この4年間一緒にたくさんの大会に出れて本当に良かったと思っています。かけがえのない経験ができて、何より最後に最高の遠征に連れて行ってもらえたことには感謝しかありません。またいつか大会に出たいと思うような時が来ると思うので、その時はいつでも戻って来てくれると嬉しいです。</p>
<p>自分はこれが最後の世界学生ですが、2年後も日本チームが出場してくれることを願っています。世界中の同世代のスカッシュ仲間と繋がる最高の機会になると思っているので、これからの学生スカッシュを担う選手にはぜひ挑戦してもらいたいです。</p>
<p>たくさんの応援ありがとうございました。</p>`
    },
    {
        title: 'スリランカPSA 3k ベスト4',
        date: '8/13 <span>2024</span>',
        category: '海外プロツアー',
        image: '../img/main/result/r2.jpeg',
        content:
`<p>人生初のスリランカに行ってきました。</p>
<p>最初は知らない土地に1人で行くことに対して不安の方が大きかったですが、終わってみれば挑戦してよかったなと思えた遠征でした。</p>
<p>南アジアの地域に行くこと自体が自分にとっては初めての経験で、文化も違えば食事も交通も育つ環境も当たり前だけど全く日本とは違うんだなということが実際に行ってみて分かりました。</p>
<p>ただ人々の優しさというのは日本人と少し似たものがあるなとも感じました。ホテルの従業員さんの丁寧なサービスであったり、タクシー運転手さんの気遣いだったり、特にスカッシュの観客の皆さんのマナーはフェアで素晴らしいなと感じました。</p>
<p>こういったことは実際に現地に行ってみないとわからないことですし、スカッシュを通して自分の知らない世界を知ることができるというのはプロツアーの一つの魅力でもあるなと思っています。</p>
<p>大会の方は今年の目標でもあったChallenger Tourベスト4進出というのをやっと達成することができました。</p>
<p>まだまだプロツアーで優勝するには多くの課題がありますが、少しずつその目標にも近づいてきていると思っているのでしっかり今やるべきことをやり続けていきたいなと思います。</p>
<p>次は2週間後に南アフリカで開催されるFISU世界大学選手権に出場してきます。2年前にも出場して今でも印象深く残っている大会なので、今回もいい経験ができるよう頑張ってきたいと思います。日本チームの応援よろしくお願いします。</p>`
    },
    {
        title: '第49回関東学生選手権 優勝',
        date: '8/5 <span>2024</span>',
        category: '国内ツアー',
        image: '../img/main/result/r3.jpg',
        content: 
` <p>最後の関学、3連覇を果たして終えました。</p>
<p>コロナ禍で始まった学生生活。最初の学生大会はこの関東学生でした。決勝ではこうたくんに惜敗し、ここまでの学生大会で唯一の負けになりました。間違いなくあの負けが自分を強くしてくれて、ここまで来させてくれたと思っています。</p>
<p>2年生の関学で初めてたくさんの同期に会った時は本当に嬉しくて、スカッシュをしていてこんなにたくさんの同期に恵まれたことがなかったのであの感動は今でも忘れられないです。</p>
<p>この関学から自分と優太の決勝戦が始まり、同期のみんなはそろそろ見飽きてきたんじゃないかと思うくらい対戦してきました。</p>
<p>そんな優太との対決も学生大会では残り1回。もちろん決勝に来てくれることを信じているので最後のインカレも全力でかかってこいと思っています。</p>
<p>来年の関学に自分はもういないのかと思うと正直信じられないのですが、今大会を通して多くの後輩達が奮闘している姿を見て、そろそろ次の世代に託してもいいのかなと思いました。</p>
<p>でもまだまだそんなもんじゃないとも思っているのでインカレではさらに強くなった姿を見せてもらって、しっかりバトンを受け継いでほしいなと思います。</p>
<p>最後に学連の皆さん、運営ありがとうございました。皆さんが裏で支えてくれているおかげでこの学生大会は成り立っています。ぜひこれからも、そして4年生の皆さんはインカレもよろしくお願いします。</p>
<p>応援ありがとうございました。</p>`
    },
    {
        title: 'シンガポールPSA Satellite　準優勝',
        date: '7/8 <span>2024</span>',
        category: '海外プロツアー',
        image: '../img/main/result/r4.jpg',
        content:
`<p>海外サテライト4度目の準優勝でした。</p>
<p>昨年シンガポールのサテライトでは2大会連続準優勝で優勝まであと1歩届かなかったのですが、今大会もその壁を越えることができませんでした。</p>
<p>自分の不甲斐なさを感じたし、今の自分の悪いところが出た決勝戦でした。かなり暑さのあるコートで最後まで集中力が持たなかったことが一番の敗因ですが、それを考慮して戦術を組み立てることができていれば間違いなく勝機はあった試合でした。</p>
<p>ただ今大会久しぶりにサテライトのカテゴリーに出場し、勝つ経験を積めたことで、自分の得点パターンや強みを再認識できたことはよかったと感じています。今後はその強みをさらに伸ばしていくことが必要だと思うのでそれに合わせてトレーニングをしていければと思います。</p>
<p>明日からはTACの試合があり、帰国直後の大会になりますが一戦一戦集中して結果にこだわって勝負していきたいと思います。</p>
<p>まだまだ2024年多くの大会が残っているので、ここから巻き返せるように頑張りたいです。</p>
<p>応援ありがとうございました。</p>`
    },
    {
        title: 'WCEアジアダブルス選手権 9位',
        date: '7/2 <span>2024</span>',
        category: '代表戦',
        image: '../img/main/result/r5.jpg',
        content: 
` <p>最終結果　ミックスダブルス 9位</p>
<p>初のダブルスに挑戦した今大会は、結果を出すことはできませんでしたが、日に日に成長を実感することができた遠征になりました。</p>
<p>日本にはダブルスコートがなく、ペアを組む選手も海外で練習していたので、前日練習の1日だけで調整しなければいけないという不安が残る中スタートした大会でした。</p>
<p>最初はダブルス特有のコートの広さとティンの低さ、そしてポジショニングの違いに戸惑いもありましたが、試合を重ねるごとに徐々に慣れていき、ペアのえりさともいいコンビネーションを見せることができるようになったと感じました。</p>
<p>この数日だけでもかなりの成長を実感できたので、練習環境が整えばまだまだ上を目指せると思いました。</p>
<p>2年後のアジア大会ではミックスダブルスが種目の一つにあるので、今回の経験を活かせるよう今後もチームで共有しながら戦っていけたらなと思います。</p>
<p>応援ありがとうございました。</p>`
    },
    {
        title: '第22回アジア選手権団体戦 第3位',
        date: '6/10 <span>2024</span>',
        category: '代表戦',
        image: '../img/main/result/r6.jpg',
        content: 
`<p>男女ともに2大会ぶりの銅メダルを獲得しました。</p>
<p>今大会のメンバーは前回大会(2022清州)と同じメンバーで普段から練習を共にしている先輩方だったので、前回よりもチームワークが増し、より一丸となって戦えたと感じました。</p>
<p>その中で自分は4番手としての役割を試合で果たすことができず、メダルは獲得できましたが個人としては悔しい気持ちの方が大きい大会となってしまいました。</p>
<p>2年後のアジア大会でメダルを獲得するには、自分が成長しなければいけないと思っているので今の課題をしっかり見直し、一つ一つ壁を乗り越えていきたいと思っています。</p>
<p>次の代表遠征は2週間後のマレーシアで開催されるアジアダブルス選手権です。2年後のアジア大会でもダブルス種目が入ってくるので、そこを見据える上でもいい経験ができればなと考えています。</p>
<p>応援ありがとうございました。</p>`
    },
];

function filterCategory(category) {
    const filteredArticles = articles.filter(article => article.category === category);
    const articleContent = document.getElementById('article-content');
    articleContent.innerHTML = '';

    filteredArticles.forEach(article => {
        const articleElement = document.createElement('div');
        articleElement.innerHTML = `
            <header class="post-info">
                <h2 class="post-title">${article.title}</h2>
                <p class="post-date">${article.date}</p>
                <p class="post-cat">カテゴリー：${article.category}</p>
            </header>
            <img src="${article.image}" alt="${article.title}">
            <p>${article.content}</p>
        `;
        articleContent.appendChild(articleElement);
    });
}
